rm(list=ls())

install.packages("readxl")
library(readxl)

### 2021 전체 데이터 가져오기
total_2021_data <- read_excel("C:\\Users\\User\\Desktop\\3인 공모전\\데이터\\기상관측 데이터\\2021_total_data.xlsx")
## 결측치 0으로 대체
total_2021_data[is.na(total_2021_data)]<-0

Daegwallyeong <- total_2021_data[1:365,] ## 대관령 데이터
Daegwallyeong_mon07 <- data.frame(Daegwallyeong[182:212,]) ## 7월 데이터

ChunCheon <- total_2021_data[366:730,]
ChunCheon

data_num <- data.frame(total_2021_data[c(1,366,731,1096,1461,1826,2191,2556,2921,3286,3651,4016,4381,4746,
                                         5111,5476,5841,6206,6571,6936,7301,7666,8031,8396,8761,9126,9491,9856,
                                         10221,10586,10951,11316,11681,12046,12411,12776,13141,13506,13871,14236,14601,14966,
                                         15331,15696,16061,16426,16791,17156,17521,17886,18251,18616,18981,19346,19711,
                                         20076,20441,20806,21171,21536,21901,22266,22631,22996,23361,23726,24091,24456,24821,
                                         25186,25551,25916,26281,26646,27011,27376,27741,28106,28471,28836,29201,29566,29931,
                                         30296,30661,31026,31391,31756,32121,32486,32851,33216,33581,33946,34311),])

tail(data_num,35)


### 태풍데이터
data_Typhoon <- read_excel("C:\\Users\\User\\Desktop\\3인 공모전\\데이터\\태풍 데이터\\태풍데이터.xlsx")
## 데이터 베이스 폼으로 변경
data_Typhoon <- data.frame(data_Typhoon) ## 7월 데이터
## 결측치 0으로 대체
data_Typhoon[is.na(data_Typhoon)] <- 0

